***PRIMARY KEY:*** should not be null and should be unique

***NOT NULL*** constraint is used to prevent **NULL** values from being inserted into a column.

This means that a column defined with NOT NULL must always contain a value, and you cannot leave it blank or assign it a NULL value.

In [ ]:
#NOT NULL
CREATE TABLE Employees (
    ID INT PRIMARY KEY,
    LastName VARCHAR(255) NOT NULL, #LastName column must have a value for every row
    FirstName VARCHAR(255), #FirstName and Age can be NULL
    Age INT
);

SyntaxError: invalid syntax (ipython-input-846956375.py, line 1)

***UNIQUE*** constraint ensures that all values in a column (or a group of columns) are different. This means that no two rows can have the same value in that column or group of columns.

In [ ]:
CREATE TABLE Persons (
    ID INT NOT NULL UNIQUE,
    LastName VARCHAR(255) NOT NULL,
    FirstName VARCHAR(255),
    Age INT,
    CONSTRAINT UC_Person UNIQUE (LastName, FirstName)
);

***CHECK***: Is used to limit the range of values that can be placed in a column. It ensures that all values in a column satisfy a specific condition.

In [ ]:
CREATE TABLE students(
    id INT Primary key,
    make VARCHAR(20) NOT NULL,
    PHNO INT UNIQUE,
    marks INT CHECK (marks > 0 AND marks > 100)
);

***CHECK*** constraint is used to enforce domain integrity by limiting the range of values that can be placed in a column. It ensures that all values in a column satisfy a specific Boolean condition you define.

In [ ]:
CREATE TABLE Persons (
    ID INT PRIMARY KEY,
    Name VARCHAR(255) NOT NULL,
    Age INT CHECK (Age >= 0) -- This CHECK constraint ensures Age is not negative
);

INSERT INTO Persons (ID, Name, Age) VALUES (1, 'Alice', 30); -- This will work
INSERT INTO Persons (ID, Name, Age) VALUES (2, 'Bob', -5);   -- This will FAIL due to CHECK constraint

**Questions**

In [ ]:
create database sqlconstraints;
use sqlconstraints;
create table students(
    id INT Primary key, #unique
    make varchar(20) not null, #not null
    PHNO int unique,
);
# -- Inserting three sample records
ADD marks INT CHECK (marks > 0 AND marks > 100); #check
ALTER TABLE students ALTER COLUMN marks SET DEFAULT 0; #default query
INSERT INTO students (id, make, PHNO) VALUES (1, 'Shiv', 987654321);
INSERT INTO students (id, make, PHNO) VALUES (2, 'Naman', 876543210);
INSERT INTO students (id, make, PHNO) VALUES (3, 'Pranit', 765432109);
UPDATE students
SET marks = CASE
WHEN id = 1 THEN 85
WHEN id = 2 THEN 92
WHEN id = 3 THEN 78
END
WHERE id IN (1, 2, 3);
SELECT * FROM students;
ALTER TABLE students
ADD CONSTRAINT chk_marks_range CHECK (marks >= 0 AND marks <= 100);

In [ ]:
CREATE TABLE Table1(
    student_id INT PRIMARY KEY, #primary key
    name VARCHAR(50) NOT NULL,
    age INT
);
INSERT INTO Table1 (student_id, name, age) VALUES
(101, "Shivashish", 20),
(102, "Srijan", 21);

SELECT * FROM Table1;
# +------------+------------+------+
# | student_id | name       | age  |
# +------------+------------+------+
# |        101 | Shivashish |   20 |
# |        102 | Srijan     |   21 |
# +------------+------------+------+
# 2 rows in set (0.00 sec)

CREATE TABLE Table2(
    student_id INT,
    FOREIGN KEY (student_id) REFERENCES Table1(student_id), #foreign key
    name VARCHAR(50) NOT NULL,
    age INT
);
INSERT INTO Table2 (student_id, course_name, duration) VALUES
(101, "Python", 140),
(102, "Srijan_Record", 160);

select * from Table2;
# +------------+-------------------+------+
# | student_id | name              | age  |
# +------------+-------------------+------+
# |        101 | Shivashish_Record |   20 |
# |        102 | Srijan_Record     |   21 |
# +------------+-------------------+------+
# 2 rows in set (0.00 sec)

In [ ]:
CREATE TABLE courses (
    course_id INT PRIMARY KEY,
    course_name VARCHAR(50) NOT NULL
);

INSERT INTO courses (course_id, course_name) VALUES (101, 'Data Science');
INSERT INTO courses (course_id, course_name) VALUES (102, 'Web Development');

CREATE TABLE enrollments (
    enrollment_id INT PRIMARY KEY,
    student_id INT,
    course_id INT,
    # -- This is the Foreign Key query
    FOREIGN KEY (student_id) REFERENCES students(id),
    FOREIGN KEY (course_id) REFERENCES courses(course_id)
);

#This works because student 1 exists
INSERT INTO enrollments (enrollment_id, student_id, course_id) VALUES (1, 1, 101);

#This works because student 2 exists
INSERT INTO enrollments (enrollment_id, student_id, course_id) VALUES (2, 2, 102);

# -- This WILL FAIL if you try it (Error: student 99 does not exist)
# -- INSERT INTO enrollments (enrollment_id, student_id, course_id) VALUES (3, 99, 101);

In [ ]:
# Ok now in follow up to table 2
# Create a table3 in which:
# student_id (primary key)
# name
# age

# Create table4:
# student_id(primary key)
# student_id(foreign key)
# Subject
# marks

# Write exact mysql query

CREATE TABLE Table3 (
    student_id INT PRIMARY KEY,
    name VARCHAR(50) NOT NULL,
    age INT
);
INSERT INTO Table3 (student_id, name, age) VALUES
(101, 'Shivashish', 20),
(102, 'Srijan', 21);

select * from table3;
# +------------+------------+------+
# | student_id | name       | age  |
# +------------+------------+------+
# |        101 | Shivashish |   20 |
# |        102 | Srijan     |   21 |
# +------------+------------+------+
# 2 rows in set (0.00 sec)

CREATE TABLE Table4 (
    subject_id INT PRIMARY KEY,  #-- New Primary Key
    student_id INT,              #-- Foreign Key
    subject VARCHAR(50),
    marks INT,
    FOREIGN KEY (student_id) REFERENCES Table3(student_id)
);

# -- Insert correct values
INSERT INTO Table4 (subject_id, student_id, subject, marks) VALUES
(1, 101, 'SQL', 98),
(2, 102, 'Python', 95);

select *from table4;
# +------------+---------+-------+
# | student_id | subject | marks |
# +------------+---------+-------+
# |        101 | SQL     |    98 |
# |        102 | Python  |    95 |
# +------------+---------+-------+
# 2 rows in set (0.00 sec)

In [ ]:
# Ok now following up table4 create table 5 in which:
# EmpId(PK)
# Emp_name(unique)
# Emp_city(not null)
# Also input values to table as printed then it will print the table

# Now create Table6:
# department_id(PK)
# EmpId(FK)
# department(not null)
# Salary 50,000, 100,000
# Also input values to table as printed then it will print the table

# Now give me exact sql query

-- Create Table 5
CREATE TABLE Table5 (
    EmpId INT PRIMARY KEY,
    Emp_name VARCHAR(50) UNIQUE,
    Emp_city VARCHAR(50) NOT NULL
);

-- Insert values into Table 5
INSERT INTO Table5 (EmpId, Emp_name, Emp_city) VALUES
(1001, 'Shivashish', 'Delhi'),
(1002, 'Srijan', 'Mumbai');

-- Print Table 5
SELECT * FROM Table5;

# mysql> SELECT * FROM Table5;
# +-------+------------+----------+
# | EmpId | Emp_name   | Emp_city |
# +-------+------------+----------+
# |  1001 | Shivashish | Delhi    |
# |  1002 | Srijan     | Mumbai   |
# +-------+------------+----------+
# 2 rows in set (0.00 sec)



-- Create Table 6
CREATE TABLE Table6 (
    department_id INT PRIMARY KEY,
    EmpId INT,
    department VARCHAR(50) NOT NULL,
    Salary INT CHECK (Salary IN (50000, 100000)),
    FOREIGN KEY (EmpId) REFERENCES Table5(EmpId)
);

-- Insert values into Table 6
INSERT INTO Table6 (department_id, EmpId, department, Salary) VALUES
(1, 1001, 'Engineering', 100000),
(2, 1002, 'Marketing', 50000);

-- Print Table 6
SELECT * FROM Table6;


# mysql> SELECT * FROM Table6;
# +---------------+-------+-------------+--------+
# | department_id | EmpId | department  | Salary |
# +---------------+-------+-------------+--------+
# |             1 |  1001 | Engineering | 100000 |
# |             2 |  1002 | Marketing   |  50000 |
# +---------------+-------+-------------+--------+
# 2 rows in set (0.00 sec)

**JOINS OF SQL**:

1. **Inner Join**: Returns only the rows where there is a match in both tables. It's the most common type of join and is often the default if you just use JOIN

SELECT columns

FROM TableA

INNER JOIN TableB

ON TableA.key = TableB.key;



2. **Left join**: Returns all rows from the left table, and the matching rows from the right table. If there's no match in the right table, NULL values are used for the right table's columns.

SELECT columns

FROM TableA

LEFT JOIN TableB

ON TableA.key = TableB.key;



3. **Right Join**: Returns all rows from the right table, and the matching rows from the left table. If there's no match in the left table, NULL values are used for the left table's columns.

SELECT columns

FROM TableA

RIGHT JOIN TableB

ON TableA.key = TableB.key;



4. **Full Join**: returns all rows when there is a match in either the left or right table. It combines the results of both LEFT JOIN and RIGHT JOIN. Unmatched rows will have NULL values for the columns of the non-matching table. (Note: Not available in MySQL, but common in PostgreSQL, SQL Server, Oracle).

SELECT columns

FROM TableA

FULL OUTER JOIN TableB

ON TableA.key = TableB.key;

In [ ]:
SELECT *
FROM Table5 T5
JOIN Table6 T6 ON T5.EmpId = T6.EmpId;

SELECT T5.Emp_name, T6.Salary
FROM Table5 T5
JOIN Table6 T6 ON T5.EmpId = T6.EmpId;

In [ ]:
CREATE TABLE customers (
    customer_id INT PRIMARY KEY,
    customer_name VARCHAR(50),
    city VARCHAR(50)
);

CREATE TABLE orders (
    order_id INT PRIMARY KEY,
    customer_id INT,
    product VARCHAR(50),
    amount INT
);

INSERT INTO customers VALUES
(1, 'Aman', 'Delhi'),
(2, 'Riya', 'Mumbai'),
(3, 'Kabir', 'Delhi'),
(4, 'Neha', 'Pune'),
(5, 'Arjun', 'Bangalore'),
(6, 'Simran', 'Mumbai'),
(7, 'Rahul', 'Delhi'),
(8, 'Pooja', 'Chennai'),
(9, 'Vikas', 'Pune'),
(10, 'Anita', 'Bangalore');

INSERT INTO orders VALUES
(101, 1, 'Laptop', 60000),
(102, 1, 'Mouse', 1500),
(103, 2, 'Mobile', 30000),
(104, 3, 'Keyboard', 2500),
(105, 3, 'Monitor', 12000),
(106, 5, 'Tablet', 20000),
(107, 6, 'Laptop', 65000),
(108, 7, 'Mobile', 28000),
(109, 7, 'Earphones', 2000),
(110, 11, 'Camera', 40000);

 select * from orders;
# +----------+-------------+-----------+--------+
# | order_id | customer_id | product   | amount |
# +----------+-------------+-----------+--------+
# |      101 |           1 | Laptop    |  60000 |
# |      102 |           1 | Mouse     |   1500 |
# |      103 |           2 | Mobile    |  30000 |
# |      104 |           3 | Keyboard  |   2500 |
# |      105 |           3 | Monitor   |  12000 |
# |      106 |           5 | Tablet    |  20000 |
# |      107 |           6 | Laptop    |  65000 |
# |      108 |           7 | Mobile    |  28000 |
# |      109 |           7 | Earphones |   2000 |
# |      110 |          11 | Camera    |  40000 |
# +----------+-------------+-----------+--------+

select * from customers;
# +-------------+---------------+-----------+
# | customer_id | customer_name | city      |
# +-------------+---------------+-----------+
# |           1 | Aman          | Delhi     |
# |           2 | Riya          | Mumbai    |
# |           3 | Kabir         | Delhi     |
# |           4 | Neha          | Pune      |
# |           5 | Arjun         | Bangalore |
# |           6 | Simran        | Mumbai    |
# |           7 | Rahul         | Delhi     |
# |           8 | Pooja         | Chennai   |
# |           9 | Vikas         | Pune      |
# |          10 | Anita         | Bangalore |
# +-------------+---------------+-----------+

select customer_name, product, amount from customers join orders on customers.customer_id=orders.customer_id; #Inner Join
# +---------------+-----------+--------+
# | customer_name | product   | amount |
# +---------------+-----------+--------+
# | Aman          | Laptop    |  60000 |
# | Aman          | Mouse     |   1500 |
# | Riya          | Mobile    |  30000 |
# | Kabir         | Keyboard  |   2500 |
# | Kabir         | Monitor   |  12000 |
# | Arjun         | Tablet    |  20000 |
# | Simran        | Laptop    |  65000 |
# | Rahul         | Mobile    |  28000 |
# | Rahul         | Earphones |   2000 |
# +---------------+-----------+--------+

select c.customer_name, o.product, o.amount from customers c join orders o on c.customer_id = o.customer_id; #same as above BUT USES ALIASES
# +---------------+-----------+--------+
# | customer_name | product   | amount |
# +---------------+-----------+--------+
# | Aman          | Laptop    |  60000 |
# | Aman          | Mouse     |   1500 |
# | Riya          | Mobile    |  30000 |
# | Kabir         | Keyboard  |   2500 |
# | Kabir         | Monitor   |  12000 |
# | Arjun         | Tablet    |  20000 |
# | Simran        | Laptop    |  65000 |
# | Rahul         | Mobile    |  28000 |
# | Rahul         | Earphones |   2000 |
# +---------------+-----------+--------+

SELECT c.customer_name, c.city, o.product, o.amount FROM customers c Join orders o ON c.customer_id = o.customer_id where c.city = 'Delhi'; #shows customers from delhi who placed order
# +---------------+-------+-----------+
# | customer_name | city  | product   |
# +---------------+-------+-----------+
# | Aman          | Delhi | Laptop    |
# | Aman          | Delhi | Mouse     |
# | Kabir         | Delhi | Keyboard  |
# | Kabir         | Delhi | Monitor   |
# | Rahul         | Delhi | Mobile    |
# | Rahul         | Delhi | Earphones |
# +---------------+-------+-----------+

select * from customers c left join orders o on c.customer_id = o.customer_id;
# +-------------+---------------+-----------+----------+-------------+-----------+--------+
# | customer_id | customer_name | city      | order_id | customer_id | product   | amount |
# +-------------+---------------+-----------+----------+-------------+-----------+--------+
# |           1 | Aman          | Delhi     |      102 |           1 | Mouse     |   1500 |
# |           1 | Aman          | Delhi     |      101 |           1 | Laptop    |  60000 |
# |           2 | Riya          | Mumbai    |      103 |           2 | Mobile    |  30000 |
# |           3 | Kabir         | Delhi     |      105 |           3 | Monitor   |  12000 |
# |           3 | Kabir         | Delhi     |      104 |           3 | Keyboard  |   2500 |
# |           4 | Neha          | Pune      |     NULL |        NULL | NULL      |   NULL |
# |           5 | Arjun         | Bangalore |      106 |           5 | Tablet    |  20000 |
# |           6 | Simran        | Mumbai    |      107 |           6 | Laptop    |  65000 |
# |           7 | Rahul         | Delhi     |      109 |           7 | Earphones |   2000 |
# |           7 | Rahul         | Delhi     |      108 |           7 | Mobile    |  28000 |
# |           8 | Pooja         | Chennai   |     NULL |        NULL | NULL      |   NULL |
# |           9 | Vikas         | Pune      |     NULL |        NULL | NULL      |   NULL |
# |          10 | Anita         | Bangalore |     NULL |        NULL | NULL      |   NULL |
# +-------------+---------------+-----------+----------+-------------+-----------+--------+

SELECT c.customer_name, c.city, o.product, o.amount FROM customers c LEFT JOIN orders o ON c.customer_id = o.customer_id; #print only selected/mentioned columns
# +---------------+-----------+-----------+--------+
# | customer_name | city      | product   | amount |
# +---------------+-----------+-----------+--------+
# | Aman          | Delhi     | Mouse     |   1500 |
# | Aman          | Delhi     | Laptop    |  60000 |
# | Riya          | Mumbai    | Mobile    |  30000 |
# | Kabir         | Delhi     | Monitor   |  12000 |
# | Kabir         | Delhi     | Keyboard  |   2500 |
# | Neha          | Pune      | NULL      |   NULL |
# | Arjun         | Bangalore | Tablet    |  20000 |
# | Simran        | Mumbai    | Laptop    |  65000 |
# | Rahul         | Delhi     | Earphones |   2000 |
# | Rahul         | Delhi     | Mobile    |  28000 |
# | Pooja         | Chennai   | NULL      |   NULL |
# | Vikas         | Pune      | NULL      |   NULL |
# | Anita         | Bangalore | NULL      |   NULL |
# +---------------+-----------+-----------+--------+

# Show all orders even if they have no customers
 select c.* from customers c left join orders o on c.customer_id = o.customer_id where o.customer_id is null;
# +-------------+---------------+-----------+
# | customer_id | customer_name | city      |
# +-------------+---------------+-----------+
# |           4 | Neha          | Pune      |
# |           8 | Pooja         | Chennai   |
# |           9 | Vikas         | Pune      |
# |          10 | Anita         | Bangalore |
# +-------------+---------------+-----------+

#Find orders with no matching customer
select o.* from orders o left join customers c on o.customer_id = c.customer_id where c.customer_id is null;
# +----------+-------------+---------+--------+
# | order_id | customer_id | product | amount |
# +----------+-------------+---------+--------+
# |      110 |          11 | Camera  |  40000 |
# +----------+-------------+---------+--------+

#Show all customers AND all orders
SELECT c.customer_name, o.product, o.amount FROM customers c LEFT JOIN orders o ON c.customer_id = o.customer_id UNION SELECT c.customer_name, o.product, o.amount FROM customers c RIGHT JOIN orders o ON c.customer_id = o.customer_id;
# +---------------+-----------+--------+
# | customer_name | product   | amount |
# +---------------+-----------+--------+
# | Aman          | Mouse     |   1500 |
# | Aman          | Laptop    |  60000 |
# | Riya          | Mobile    |  30000 |
# | Kabir         | Monitor   |  12000 |
# | Kabir         | Keyboard  |   2500 |
# | Neha          | NULL      |   NULL |
# | Arjun         | Tablet    |  20000 |
# | Simran        | Laptop    |  65000 |
# | Rahul         | Earphones |   2000 |
# | Rahul         | Mobile    |  28000 |
# | Pooja         | NULL      |   NULL |
# | Vikas         | NULL      |   NULL |
# | Anita         | NULL      |   NULL |
# | NULL          | Camera    |  40000 |
# +---------------+-----------+--------+

#To select records where the department is not 'HR' or 'IT', use the NOT IN operator.
SELECT * FROM employees WHERE department NOT IN ('HR', 'IT');
# +---------------+-------+-------------+--------+
# | department_id | EmpId | department  | Salary |
# +---------------+-------+-------------+--------+
# |             1 |  1001 | Engineering | 100000 |
# |             2 |  1002 | Marketing   |  50000 |
# +---------------+-------+-------------+--------+

#give between 50,000 AND 100,000
SELECT * FROM employees WHERE Salary BETWEEN 50000 AND 100000;
# +---------------+-------+-------------+--------+
# | department_id | EmpId | department  | Salary |
# +---------------+-------+-------------+--------+
# |             1 |  1001 | Engineering | 100000 |
# |             2 |  1002 | Marketing   |  50000 |
# +---------------+-------+-------------+--------+

SUBQUERY: Subquery is a query whose results are used by another query

In [ ]:
# create database employees and
# Select employees, salary from table1 where salary>(select avg(salary)from table1)
# Find average salary
# Filter whose salary is greater than average salary
# So first input values creating database and table and then performing exact query asked

create database employees;
USE employees;

-- Create table1
CREATE TABLE table1 (
    emp_id INT PRIMARY KEY,
    name VARCHAR(50),
    salary INT
);
INSERT INTO table1 (emp_id, name, salary) VALUES
(1, 'Aman', 50000),
(2, 'Srijan', 75000),
(3, 'Shivashish', 100000),
(4, 'Ayush', 60000);

SELECT AVG(salary) AS average_salary FROM table1;
# +----------------+
# | average_salary |
# +----------------+
# |     71250.0000 |
# +----------------+

-- This matches your exact requested syntax
SELECT name, salary
FROM table1
WHERE salary > (SELECT AVG(salary) FROM table1);
# +------------+--------+
# | name       | salary |
# +------------+--------+
# | Srijan     |  75000 |
# | Shivashish | 100000 |
# +------------+--------+

In [ ]:
#subquery in sqlconstraints database
use sqlconstraints;
select customer_name from customers where customer_id in(select customer_id from orders);
# +---------------+
# | customer_name |
# +---------------+
# | Aman          |
# | Riya          |
# | Kabir         |
# | Arjun         |
# | Simran        |
# | Rahul         |

In [ ]:
#find customer who have not placed any order
 select customer_name from customers where customer_id not in(select customer_id from orders);
# +---------------+
# | customer_name |
# +---------------+
# | Neha          |
# | Pooja         |
# | Vikas         |
# | Anita         |
# +---------------+

In [ ]:
# find customers who have placed an order with amount greater than the average order amount
 select customer_name from customers where customer_id IN(select customer_id from orders where amount>(select avg(amount) from orders));
# +---------------+
# | customer_name |
# +---------------+
# | Aman          |
# | Riya          |
# | Simran        |
# | Rahul         |
# +---------------+

In [ ]:
#trasaction
# a transaction is a a sequence of sql operations executed as a single unit where either all changes are commited or all are rolled back (all or nothing)
#rahul and neha have perticular amount of money add and withdraw money usnign transaction concept
#make proper table before using below command
start transaction;
update bank_account set balance = balance-500 where acc_id=1;
update bank_account se balance = balance+1000 where acc_id=2;
 select * from bank_account;
# +--------+----------+---------+
# | acc_id | acc_name | balance |
# +--------+----------+---------+
# |      1 | rahul    |    4000 |
# |      2 | neha     |    4000 |
# +--------+----------+---------+

In [ ]:
#indexing
#indexing is nothing used to fetch data in sql efficently and fastly
#index helps sql find data faster , just like a book index or page number.
#without index: u have to start from page 1 read every page and it is very slow
#but with index go to perticular page directly.
#syntax
create index idx_name on table1(name);
select * from customers where customer_name="Vikas";
# +-------------+---------------+------+
# | customer_id | customer_name | city |
# +-------------+---------------+------+
# |           9 | Vikas         | Pune |
# +-------------+---------------+------+
#drawbacks : insert , update, delete became slow after indexing

           #: not for smalll tables always use for large tables
           #:occupies space

In [ ]:
#alter command
 alter table orders add age int;
alter table orders add agee int default 19;
 select * from orders;
# +----------+-------------+-----------+--------+------+------+
# | order_id | customer_id | product   | amount | age  | agee |
# +----------+-------------+-----------+--------+------+------+
# |      101 |           1 | Laptop    |  60000 | NULL |   19 |
# |      102 |           1 | Mouse     |   1500 | NULL |   19 |
# |      103 |           2 | Mobile    |  30000 | NULL |   19 |
# |      104 |           3 | Keyboard  |   2500 | NULL |   19 |
# |      105 |           3 | Monitor   |  12000 | NULL |   19 |
# |      106 |           5 | Tablet    |  20000 | NULL |   19 |
# |      107 |           6 | Laptop    |  65000 | NULL |   19 |
# |      108 |           7 | Mobile    |  28000 | NULL |   19 |
# |      109 |           7 | Earphones |   2000 | NULL |   19 |
# |      110 |          11 | Camera    |  40000 | NULL |   19 |
# +----------+-------------+-----------+--------+------+------+

In [ ]:
#SQL COMMANDS
# 1:DDL-- structure(design)
# 2:DML--data(rows)
# 3:DQL-- fetch data
# 4:DCL-- security
# 5:TCL--transaction

#1:DDL-data defination language
  #  create
  #  alter
  #  drop
  #  rename
  #  truncate
#2:DML-- data manipulation language
    # insert
    # update
    # delete
#3:DQL--data query language
    # select
3#:DCL:--data control language
    #  grant
    #  grant select on (tablename) to user1;
    #  revoke
    #  revoke select on(tablename) to user1;

#4:TCL--transaction control language
    #  savepoint
    #  commit
    #  rollback

In [ ]:
#normalisation
# bad table ---->> good table
# 1.data manipulation
# 2.insert anomaly
# 3.update anomaly
# 4.delete anomaly